УТ_для_edt.РасширениеСмарт/src/Documents/ЗаданиеНаПеревозку/ЗаданиеНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаданиеНаПеревозку</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ТранспортноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КурьерЭкспедитор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВремяРейсаПланС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВремяРейсаПланПо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВремяРейсаФактС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВремяРейсаФактПо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Распоряжения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Перевозчик</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПолучательОтправитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВремяС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВремяПо</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДополнительнаяИнформация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Доставлено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоставляетсяПолностью</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Маршрут</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КлючСвязи</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Зона</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВремяС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВремяПо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Доставлено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДополнительнаяИнформация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АдресЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/СмартСтатусОтслеживаниеОтправления/СмартСтатусОтслеживаниеОтправления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="041da5e8-eb95-4ff3-ae40-9b24fce14854">
  <name>СмартСтатусОтслеживаниеОтправления</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes extendedConfigurationObject="1b687659-84e2-4e63-9593-84762a9f969b">
    <name>СтатусЗадания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e65ef157-c3f0-422e-bed6-9c90b04800cb">
    <name>ТрекНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="9b865b07-7fef-4cb9-9a04-411cc62c0642">
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="dd9ab401-f19d-4fee-89d6-0cbb7ccdc6ea">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Enums/СтатусыЗаданийНаПеревозку/СтатусыЗаданийНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЗаданийНаПеревозку</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Формируется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Закрыто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.смартОстаткиНаСкладеГарантийныхЗапчастей</registerRecords>
  <attributes>
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗонаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаданиеНаПеревозку/ObjectModule.bsl
#Область ПеренесеноСДоработкамиСмарт

&После("ОбработкаУдаленияПроведения")
Процедура смарт_ОбработкаУдаленияПроведения(Отказ)
	
	//++#1241 смарт: Лопато 25.01.2023 //Доработать алгоритм вычисления статуса заказа для сайта.  
	Если НЕ Отказ И Константы.смартЗаказыСтатусНаСайтБитрикс.Получить() Тогда
		смартРассчитатьПараметрДоставкиПоЗаказам(ЭтотОбъект, ДополнительныеСвойства);
	КонецЕсли;
	//--#1241 смарт: Лопато 25.01.2023
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++#1241 смарт: Лопато 09.12.2022 //Доработать алгоритм вычисления статуса заказа для сайта.
Функция смартСформироватьТаблицуРаспоряженийДляРасчетаПараметровСтатусовЗаказовБитрикс(ЗаданиеОбъект)

	ТаблицаРаспоряжений = ЗаданиеОбъект.Распоряжения.Выгрузить(, "Распоряжение");

	ТаблицаРаспоряженийПрошлая = ЗаданиеОбъект.Ссылка.Распоряжения;
	
	Для Каждого СтрРаспоряжение Из ТаблицаРаспоряженийПрошлая Цикл
		НоваяСтрРаспоряжение = ТаблицаРаспоряжений.Добавить();
		НоваяСтрРаспоряжение.Распоряжение = СтрРаспоряжение.Распоряжение;
	КонецЦикла;	
	
	Возврат ТаблицаРаспоряжений;

КонецФункции //--#1241 смарт: Лопато 09.12.2022

//++#1241 смарт: Лопато 25.01.2023 //Доработать алгоритм вычисления статуса заказа для сайта.  
Процедура смартРассчитатьПараметрДоставкиПоЗаказам(Объект, ДопСвойства)
	
	Если ДопСвойства.Свойство("ТаблицаРаспоряженийДляРасчетаПараметровСтатусовЗаказовБитрикс") Тогда
		ТаблицаРаспоряженийДляРасчетаПараметровСтатусовЗаказовБитрикс = ДопСвойства.ТаблицаРаспоряженийДляРасчетаПараметровСтатусовЗаказовБитрикс;
	Иначе
		ТаблицаРаспоряженийДляРасчетаПараметровСтатусовЗаказовБитрикс = ЭтотОбъект.Распоряжения.Выгрузить(, "Распоряжение");
	КонецЕсли;	

	ТаблицаРаспоряженийДляРасчетаПараметровСтатусовЗаказовБитрикс.Свернуть("Распоряжение");
	
	МассивРаспоряженийДляРасчетаПараметровСтатусовЗаказовБитрикс = Новый Массив;
	
	Для Каждого СтрокаРаспоряжения Из ТаблицаРаспоряженийДляРасчетаПараметровСтатусовЗаказовБитрикс Цикл
		
		Если ТипЗнч(СтрокаРаспоряжения.Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") 
			И Б_ОбменССайтомСервер.смартПроверкаЗаказНужноВыгружатьНаСайт(СтрокаРаспоряжения.Распоряжение, Истина) Тогда
			
			МассивРаспоряженийДляРасчетаПараметровСтатусовЗаказовБитрикс.Добавить(СтрокаРаспоряжения.Распоряжение);
			
		КонецЕсли;
		
	КонецЦикла;	
	
	СтруктураДействийРасчета = Новый Структура("Заказ");
	смарт_РаботаССтатусамиЗаказа.смартРассчитатьПараметрыСтатусовЗаказовБитрикс(МассивРаспоряженийДляРасчетаПараметровСтатусовЗаказовБитрикс, СтруктураДействийРасчета);
		
КонецПроцедуры //--#1241 смарт: Лопато 25.01.2023

//++ #1669 смарт: Мосолов 07.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаданиеНаПеревозку  
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура смарт_ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведенПередЗаписью = ДополнительныеСвойства.ПроведенПередЗаписью;
	СтатусПередЗаписью = ДополнительныеСвойства.СтатусПередЗаписью;
	
	// Проверка можно ли устанавливать статус
	Если Операция = Перечисления.ВидыДоставки.СоСклада
		И (Статус = Перечисления.СтатусыЗаданийНаПеревозку.Отправлено 
			Или Статус = Перечисления.СтатусыЗаданийНаПеревозку.Закрыто) Тогда
		
		// Проверка на все ли количество по заданию на перевозку оформлены расходные ордера,
		// только для складов с ФО НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку.
		КонтрольОформленныхОрдеровПоЗаданиюНаПеревозку(Ссылка, Отказ);
		
		// Проверка готовности расходных ордеров
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТовары.Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|ГДЕ
		|	РасходныйОрдерНаТовары.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку
		|	И НЕ(РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтгрузке)
		|				ИЛИ РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен))
		|	И РасходныйОрдерНаТовары.Проведен";
		Запрос.УстановитьПараметр("ЗаданиеНаПеревозку", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения = НСтр("ru = 'Расходный ордер ""%Ссылка%"" по заданию на перевозку не готов к отгрузке.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Выборка.Ссылка);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,Выборка.Ссылка,,,Отказ);
			
		КонецЦикла;
	
	// Запуск автоматического создания расходных ордеров
	// для складов с ФО НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку.
	ИначеЕсли Операция = Перечисления.ВидыДоставки.СоСклада
		И Константы.РежимФормированияРасходныхОрдеров.Получить() = Перечисления.РежимыФормированияРасходныхОрдеров.Автоматически
		
		И (		Статус = Перечисления.СтатусыЗаданийНаПеревозку.КПогрузке
				И Не ПроведенПередЗаписью
				
			Или 
			
				Статус = Перечисления.СтатусыЗаданийНаПеревозку.КПогрузке
				И СтатусПередЗаписью = Перечисления.СтатусыЗаданийНаПеревозку.Формируется
				
			Или
			
				Статус = Перечисления.СтатусыЗаданийНаПеревозку.Формируется
				И СтатусПередЗаписью <> Перечисления.СтатусыЗаданийНаПеревозку.Формируется
				И ПроведенПередЗаписью
			) Тогда
			
		Документы.ЗаданиеНаПеревозку.СформироватьОчередьПереоформленияРасходныхОрдеров(Ссылка, Отказ);
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоНовый
		Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Изменить статус расходных ордеров на "Отгружен" по отправленным заданиям на перевозку,
	// если все ордера оформлены и находятся в статусе не ниже КОтгрузке (это проверяется выше).
	Если Операция = Перечисления.ВидыДоставки.СоСклада
		И (Статус = Перечисления.СтатусыЗаданийНаПеревозку.Закрыто
			ИЛИ Статус = Перечисления.СтатусыЗаданийНаПеревозку.Отправлено)
		И (Не ПроведенПередЗаписью
			Или 
				(СтатусПередЗаписью <> Перечисления.СтатусыЗаданийНаПеревозку.Закрыто
				И СтатусПередЗаписью <> Перечисления.СтатусыЗаданийНаПеревозку.Отправлено
				И Статус <> СтатусПередЗаписью)) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РасходныйОрдерНаТовары.Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|ГДЕ
		|	РасходныйОрдерНаТовары.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку
		|	И РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтгрузке)
		|	И РасходныйОрдерНаТовары.Проведен";
		Запрос.УстановитьПараметр("ЗаданиеНаПеревозку", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
			
		Если Не Запрос.Выполнить().Пустой() Тогда
			
			СкладыСервер.ЗапускВыполненияФоновогоПереводаСтатусаРасходногоОрдераВОтгружено(Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;  
	
	#Вставка  
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 23.07.2020 17:20:15 задача 522
    //Подготовка свойства Идентификатор отправления, для заполнения по реализациям
    МенеджерВременныхТаблицСвойств 	= Новый МенеджерВременныхТаблиц;
    СвойствоСтрокой="Идентификатор отправления";
    
    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицСвойств;
    Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДополнительныеРеквизитыИСведения.Ссылка,
    |	ДополнительныеРеквизитыИСведения.ТипЗначения,
    |	ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение,
    |	ДополнительныеРеквизитыИСведения.Заголовок  КАК Заголовок
    |ПОМЕСТИТЬ ВремДопРеквизиты
    |ИЗ
    |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
    |ГДЕ
    |	НЕ ДополнительныеРеквизитыИСведения.ПометкаУдаления
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	Заголовок";
    Запрос.Выполнить();
    
    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицСвойств;
    Запрос.УстановитьПараметр("СоздаватьРеквизит", Истина);
    Запрос.Текст ="ВЫБРАТЬ *
    |ИЗ
    |	ВремДопРеквизиты КАК ВремДопРеквизиты
    |ГДЕ
    |	ВремДопРеквизиты.Заголовок Подобно &Заголовок
    |	И ВремДопРеквизиты.ЭтоДополнительноеСведение = &СоздаватьРеквизит";
    Запрос.УстановитьПараметр("Заголовок", СвойствоСтрокой+"%");
    
    СвойствоЗаказа = НеОпределено;
    Свойство = НеОпределено;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Если Выборка.Ссылка.НаборСвойств.ИмяПредопределенныхДанных="Документ_РеализацияТоваровУслуг" Тогда
            Свойство = Выборка.Ссылка;
        ИначеЕсли Выборка.Ссылка.НаборСвойств.ИмяПредопределенныхДанных="Документ_ЗаказКлиента" Тогда
            СвойствоЗаказа = Выборка.Ссылка;
        КонецЕсли; 
    КонецЦикла;
    //------------------------------------------------------------------------------------ 
    Для Каждого стрТЗ из ЭтотОбъект.Распоряжения Цикл
        Если ЗначениеЗаполнено(стрТЗ.смартТрекНомер) Тогда
            Если СвойствоЗаказа <> НеОпределено И ТипЗнч(стрТЗ.Распоряжение)=ТИП("ДокументСсылка.ЗаказКлиента") Тогда
                // НаборЗаписейЗаказ.Отбор.Объект.Установить(стрТЗ.Распоряжение);
                //НаборЗаписейЗаказ.Отбор.Свойство.Установить(стрТЗ.СвойствоЗаказа);
                // НаборЗаписейЗаказ.Прочитать();
                МенеджерЗаписиЗаказ = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
                МенеджерЗаписиЗаказ.Объект 		    = стрТЗ.Распоряжение;
                МенеджерЗаписиЗаказ.Значение    	= стрТЗ.смартТрекНомер;
                МенеджерЗаписиЗаказ.Свойство 	    = СвойствоЗаказа;
                МенеджерЗаписиЗаказ.Записать();
            КонецЕсли; 
            НаборЗаписей = РегистрыСведений.СмартСтатусОтслеживаниеОтправления.СоздатьНаборЗаписей();
            НаборЗаписей.Отбор.ЗаданиеНаПеревозку.Установить(ЭтотОбъект.Ссылка);
            НаборЗаписей.Отбор.Заказ.Установить(стрТЗ.Распоряжение);
            //НаборЗаписей.Отбор.СтатусЗадания.Установить(ЭтотОбъект.Статус);
            //НаборЗаписей.Отбор.ТрэкНомер.Установить(стрТЗ.ТрекНомер);
            НаборЗаписей.Прочитать();
            
            ДобавлятьЗапись=Ложь;
            СтруктураОтбора=Новый Структура;
            СтруктураОтбора.Вставить("ЗаданиеНаПеревозку",ЭтотОбъект.Ссылка);
            СтруктураОтбора.Вставить("Заказ",стрТЗ.Распоряжение);
            ТзПоследние=РегистрыСведений.СмартСтатусОтслеживаниеОтправления.СрезПоследних(ТекущаяДата(),СтруктураОтбора);
            Для Каждого СтрЗнч из ТзПоследние Цикл
                Если СтрЗнч.ЗаданиеНаПеревозку = ЭтотОбъект.Ссылка И СтрЗнч.Заказ = стрТЗ.Распоряжение И
                    СтрЗнч.ТрекНомер = стрТЗ.смартТрекНомер И СтрЗнч.СтатусЗадания = ЭтотОбъект.Статус Тогда
                иначе
                    ДобавлятьЗапись=Истина;	
                КонецЕсли;
            КонецЦикла;
            
            Если НаборЗаписей.Количество()=0 Тогда
                ДобавлятьЗапись=Истина;
            КонецЕсли;
            
            Если ДобавлятьЗапись Тогда
                //	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
                НоваяЗапись = НаборЗаписей.Добавить();
                НоваяЗапись.ЗаданиеНаПеревозку=ЭтотОбъект.Ссылка;
                НоваяЗапись.Заказ=стрТЗ.Распоряжение;
                НоваяЗапись.СтатусЗадания= ЭтотОбъект.Статус;
                НоваяЗапись.ТрекНомер=стрТЗ.смартТрекНомер;
                НоваяЗапись.Период=ТекущаяДата();
                НаборЗаписей.Записать();
				//++#1241 смарт: Лопато 25.01.2023 //Доработать алгоритм вычисления статуса заказа для сайта.  
				//Если Константы.смартЗаказыСтатусНаСайтБитрикс.Получить() Тогда
                //    смарт_РаботаССтатусамиЗаказа.ОтразитьСостояниеЗаказаБитрикс(стрТЗ.Распоряжение.ПолучитьОбъект());
                //КонецЕсли;
				//--#1241 смарт: Лопато 25.01.2023
            КонецЕсли;
            
            //Запись доп. сведения документа реализации
            Если Свойство<>Неопределено И ТипЗнч(стрТЗ.Распоряжение)=ТИП("ДокументСсылка.ЗаказКлиента") Тогда
                
                Запрос=Новый Запрос;
                Запрос.Текст="ВЫБРАТЬ
                |	СвязанныеДокументы.Ссылка КАК Ссылка
                |ИЗ
                |	КритерийОтбора.СвязанныеДокументы(&ОбъектЗаказ) КАК СвязанныеДокументы
                |ГДЕ
                |	СвязанныеДокументы.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг";
                Запрос.УстановитьПараметр("ОбъектЗаказ",стрТЗ.Распоряжение);
                РезультатЗапроса=Запрос.Выполнить();
                Если РезультатЗапроса.Пустой() Тогда
                    Продолжить;
                Иначе
                    НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
                    ВыборкаРезультат=РезультатЗапроса.Выбрать(); 
                    Пока ВыборкаРезультат.Следующий() Цикл
                        НаборЗаписей.Отбор.Объект.Установить(ВыборкаРезультат.Ссылка);
                        НаборЗаписей.Отбор.Свойство.Установить(Свойство);
                        НаборЗаписей.Прочитать();
                        Если НаборЗаписей.Количество()=0 Тогда
                            НоваяЗапись = НаборЗаписей.Добавить(); 
                            НоваяЗапись.Объект 		= ВыборкаРезультат.Ссылка;
                            НоваяЗапись.Значение 	= стрТЗ.смартТрекНомер;
                            НоваяЗапись.Свойство 	= Свойство;
                        Иначе
                            НаборЗаписей[0].Значение 	= стрТЗ.смартТрекНомер; 
                        КонецЕсли; 
                        //Зарегистрируем реализацию и заказ, возможно до внесения трек номера, документ будет отправлен на сайт.
                        ОбъектДок=ВыборкаРезультат.Ссылка.ПолучитьОбъект();
                        Б_ОбменССайтомСервер.ЗарегистрироватьИзмененияПриЗаписиСправочникаДокументаДляОбменаССайтами(ОбъектДок,Ложь);
                    КонецЦикла; 
                    НаборЗаписей.Записать();
                    
                КонецЕсли; 
            КонецЕсли;
        КонецЕсли; 		
	КонецЦикла;

	//++#1241 смарт: Лопато 25.01.2023 //Доработать алгоритм вычисления статуса заказа для сайта.  
	Если НЕ Отказ И Константы.смартЗаказыСтатусНаСайтБитрикс.Получить() Тогда
		смартРассчитатьПараметрДоставкиПоЗаказам(ЭтотОбъект, ДополнительныеСвойства);
	КонецЕсли;
	//--#1241 смарт: Лопато 25.01.2023

	//Смарт }Подкин Алексей Иванович 23.07.2020 17:20:15
	#КонецВставки
	
КонецПроцедуры //-- #1669 смарт: Мосолов 07.03.2024   

//++ #1669 смарт: Мосолов 07.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаданиеНаПеревозку  
&ИзменениеИКонтроль("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	Документы.ЗаданиеНаПеревозку.ЗаполнитьВремяРейсаПланФакт(ЭтотОбъект);

	// Вес и Объем в единицах измерения
	Вес   = Маршрут.Итог("Вес") * ДоставкаТоваров.КоэффициентПересчетаВТонны();
	Объем = Маршрут.Итог("Объем") * ДоставкаТоваров.КоэффициентПересчетаВКубическиеМетры();
	#Вставка
	//++ #Б4398 смарт: Шляпников 02.10.2025 / Задания на перевозку. Заполнение поля "Вес". Разработка. 
	ВесБрутто = Маршрут.Итог("ВесБрутто") * ДоставкаТоваров.КоэффициентПересчетаВТонны();
	//-- #Б4398 смарт: Шляпников 02.10.2025
	#КонецВставки

	КоличествоПунктов = Маршрут.Количество();

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		Или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Т.Распоряжение
		|ПОМЕСТИТЬ Распоряжения
		|ИЗ
		|	&Распоряжения КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.Распоряжение
		|ИЗ
		|	(ВЫБРАТЬ
		|		Т.Распоряжение КАК Распоряжение
		|	ИЗ
		|		Документ.ЗаданиеНаПеревозку.Распоряжения КАК Т
		|	ГДЕ
		|		Т.Ссылка = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Т.Распоряжение
		|	ИЗ
		|		Распоряжения КАК Т) КАК Т";

		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Распоряжения", Распоряжения.Выгрузить(,"Распоряжение"));
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		ДополнительныеСвойства.Вставить("РаспоряженияДляЗаписиСостояния", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Распоряжение"));
	КонецЕсли;

	ДополнительныеСвойства.Вставить("СтатусПередЗаписью", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Статус"));
	ДополнительныеСвойства.Вставить("ПроведенПередЗаписью", Проведен);
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());

	ЗаданиеНаПеревозкуЛокализация.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);  
	
	#Вставка  
	
	//++#1241 смарт: Лопато 09.12.2022 //Доработать алгоритм вычисления статуса заказа для сайта.
	Если НЕ Отказ И Константы.смартЗаказыСтатусНаСайтБитрикс.Получить() Тогда
		ДополнительныеСвойства.Вставить("ТаблицаРаспоряженийДляРасчетаПараметровСтатусовЗаказовБитрикс", 
										смартСформироватьТаблицуРаспоряженийДляРасчетаПараметровСтатусовЗаказовБитрикс(ЭтотОбъект));
	КонецЕсли;	
	//--#1241 смарт: Лопато 09.12.2022
	
	#КонецВставки

КонецПроцедуры //-- #1669 смарт: Мосолов 07.03.2024

#КонецОбласти
